# VectorAtPoint Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VectorAtPoint Members
VectorAtPoint Class Constructors Methods Properties See Also
---
The VectorAtPoint type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| VectorAtPoint(VectorAtPoint) | Creates a copy of the given VectorAtPoint instance. |
| VectorAtPoint(IList<(Of <<'(XYZ>)>>)) | Creates object from an array of vectors |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ClearAllFlags | Sets flags for all measurements to ValueAtPointFlags::None.  (Inherited from ValueAtPointBase.) |
| ClearFlagsAt | Sets flags for the given measurement to ValueAtPointFlags::None.  (Inherited from ValueAtPointBase.) |
| Dispose | (Inherited from ValueAtPointBase.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetFlags | Returns flags for the given measurement.  (Inherited from ValueAtPointBase.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetFlags(IList<(Of <<'(Int32>)>>)) | Independently sets the flags associated to all measurements.  (Inherited from ValueAtPointBase.) |
| SetFlags(Int32) | Sets the flags associated to all measurements to the same value.  (Inherited from ValueAtPointBase.) |
| SetFlags(Int32, Int32) | Sets the flags associated to a given measurement.  (Inherited from ValueAtPointBase.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ValueAtPointBase.) |

# See Also
VectorAtPoint Class
Autodesk.Revit.DB.Analysis Namespace